{
  "backend/main.mo": "Motoko canister handling user profiles with access control and blog posts with categories, storage, seeding, and permission checks.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and tests with metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of all major frontend components, hooks, pages, and utilities.",
  "frontend/index.css": "Global CSS defining Tailwind layers and OKLCH-based light/dark theme variables for the site's color system.",
  "frontend/index.html": "Base HTML document providing root container and loading the React application entry point.",
  "frontend/src/App.tsx": "Application router defining layout and routes for home, posts, details, about, and admin pages with theme support.",
  "frontend/src/components/admin/AdminPostList.tsx": "Admin post list showing posts with edit/delete actions, loading states, and delete confirmation.",
  "frontend/src/components/admin/PostEditor.tsx": "Form for creating or editing posts with title, content, category, cover image, and excerpt handling.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading and error handling.",
  "frontend/src/components/CategoryFilter.tsx": "Tabbed filter component allowing selection of post categories using icons and labels.",
  "frontend/src/components/PostCard.tsx": "Card component showing a post’s cover image, title, category, excerpt, and date with link to details.",
  "frontend/src/components/SiteFooter.tsx": "Footer with site description, navigation links, social icons, and attribution to caffeine.ai.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with navigation links, admin link if authorized, and mobile menu toggle.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdmin.ts": "Checks if the current authenticated user is an admin using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and utilities for managing Internet Identity login, logout, and stored sessions.",
  "frontend/src/hooks/usePostMutations.ts": "React Query mutations for creating, updating, and deleting posts via the backend actor.",
  "frontend/src/hooks/usePosts.ts": "Hooks to fetch all posts, a single post, or posts filtered by category using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, custom CSS variables for light and dark themes, typography, and scrollbar styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider, then renders App.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page with mission info, creator bio, and feature highlights.",
  "frontend/src/pages/AdminPage.tsx": "Displays admin panel with authentication, permission checks, post list, and post editor.",
  "frontend/src/pages/HomePage.tsx": "Shows homepage with hero section, intro text, and feature highlights for theatre content.",
  "frontend/src/pages/PostDetailsPage.tsx": "Fetches and displays a full post with metadata, cover image, and admin edit option.",
  "frontend/src/pages/PostsPage.tsx": "Lists posts with category filtering, loading states, and admin new‑post button.",
  "frontend/src/utils/postCategories.ts": "Maps post categories to human-readable labels and corresponding icons.",
  "frontend/src/utils/postMetaStorage.ts": "Stores and retrieves post cover images and excerpts using localStorage with fallbacks.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read URL parameters (including hash routing) and persist them in sessionStorage, plus helpers to clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, fonts, animations, and plugins such as typography, container queries, and animate.",
  "project_state.json": "Project state metadata describing the blog’s goals, features, image requirements, and architecture notes for the theatre-focused site."
}